{
  "architectures": ["DF-Arena-1B-V0.1"],
  "model_type": "antispoofing",

  "num_labels": 2,
  "id2label": {
    "1": "bonafide",
    "0": "spoof"
  },
  "label2id": {
    "bonafide": 1,
    "spoof": 0
  },

  "auto_map": {
    "AutoConfig": "configuration_antispoofing.DF_Arena_1B_Config",
    "AutoModel": "modeling_antispoofing.DF_Arena_1B_Antispoofing",
    "AutoFeatureExtractor": "feature_extraction_antispoofing.AntispoofingFeatureExtractor"
  },
  "custom_pipelines": {
    "antispoofing": {
      "impl": "pipeline_antispoofing.AntispoofingPipeline",
      "pt": ["AutoModel"]
    }
  }
}
